; domain
(define (domain blocksworld)
(:requirements :typing)
(:types block - object
)
(:predicates (on ?x - block ?y - block)
(ontable ?x - block)
(clear ?x - block)
(handempty)
(holding ?x - block)
(stai_on ?x - block ?y - block)
;(stag_on ?x - block ?y - block)

(dummy-goal)(dummy-fact)(dummy-tabustate0))
(:functions (cost))(:action pick-up
:parameters ( ?x - block)
:precondition (and (clear ?x)(ontable ?x)(handempty))
:effect (and (not (ontable ?x))(not (clear ?x))(not (handempty))(holding ?x))
)
(:action put-down
:parameters ( ?x - block)
:precondition (and (holding ?x))
:effect (and (not (holding ?x))(clear ?x)(handempty)(ontable ?x))
)
(:action stack
:parameters ( ?x - block ?y - block)
:precondition (and (holding ?x)(clear ?y));(stag_on ?x ?y))
:effect (and (not (holding ?x))(not (clear ?y))(clear ?x)(handempty)(on ?x ?y))
)
(:action unstack
:parameters ( ?x - block ?y - block)
:precondition (and (clear ?x)(handempty)(stai_on ?x ?y))
:effect (and (holding ?x)(clear ?y)(not (clear ?x))(not (handempty))(not (stai_on ?x ?y)))
)

(:action pref-op0
  :precondition (and (dummy-fact))
  :effect (and (not (dummy-fact)) (dummy-goal)))(:action tabu-op0-1
:precondition (and (not (dummy-fact)) (not (clear b1)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-2
:precondition (and (not (dummy-fact)) (not (clear b2)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-3
:precondition (and (not (dummy-fact)) (not (clear b4)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-4
:precondition (and (not (dummy-fact)) (not (clear b5)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-5
:precondition (and (not (dummy-fact)) (not (clear b6)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-6
:precondition (and (not (dummy-fact)) (not (clear b8)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-7
:precondition (and (not (dummy-fact)) (not (handempty )))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-8
:precondition (and (not (dummy-fact)) (not (on b8 b9)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-9
:precondition (and (not (dummy-fact)) (not (on b9 b10)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-10
:precondition (and (not (dummy-fact)) (not (ontable b1)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-11
:precondition (and (not (dummy-fact)) (not (ontable b2)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-12
:precondition (and (not (dummy-fact)) (not (ontable b3)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-13
:precondition (and (not (dummy-fact)) (not (ontable b4)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-14
:precondition (and (not (dummy-fact)) (not (ontable b5)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-15
:precondition (and (not (dummy-fact)) (not (ontable b7)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-16
:precondition (and (not (dummy-fact)) (not (stai_on b10 b3)))
:effect (and (dummy-tabustate0)))

(:action tabu-op0-17
:precondition (and (not (dummy-fact)) (not (stai_on b6 b7)))
:effect (and (dummy-tabustate0)))

)

; problem
(define (problem bw-typed-n10)
(:domain blocksworld)
(:objects 
b1 b2 b3 b4 b5 b6 b7 b8 b9 b10  - block)
(:INIT (= (cost) 0)
	(dummy-fact)
(clear b1)
(clear b2)
(clear b4)
(clear b5)
(clear b6)
(clear b9)
(handempty )
(on b9 b10)
(ontable b1)
(ontable b2)
(ontable b3)
(ontable b4)
(ontable b7)
(ontable b8)
(stai_on b10 b3)
(stai_on b5 b8)
(stai_on b6 b7)
)
(:goal (and
(dummy-goal)
(on b8 b9)
(dummy-tabustate0)
))
(:metric maximize (cost))
)

; plan
1. (pref-op0)
   deleted: (dummy-fact)
   added: (dummy-goal)
   goals met: 1 of 3
2. (unstack b5 b8)
   deleted: (clear b5) (handempty) (stai_on b5 b8)
   added: (holding b5) (clear b8)
   goals met: 1 of 3
3. (tabu-op0-4)
   added: (dummy-tabustate0)
   goals met: 2 of 3
4. (put-down b5)
   deleted: (holding b5)
   added: (clear b5) (handempty) (ontable b5)
   goals met: 2 of 3
5. (pick-up b8)
   deleted: (ontable b8) (clear b8) (handempty)
   added: (holding b8)
   goals met: 2 of 3
6. (stack b8 b9)
   deleted: (holding b8) (clear b9)
   added: (clear b8) (handempty) (on b8 b9)
   goals met: 3 of 3
